## Plan Result (fxa-webhook-proxy-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/99663)



<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171 will be updated in-place
  ~ resource "aws_lambda_function" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171" {
        id                             = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function:1051" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function:1051/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "1051" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"            = "610d31969a5a7b765ac66bfdaddd1b703598c59e" -> null
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"c7a57ac4-96e6-42d7-9ee4-0c77112a34d5","JobName":"fxa-webhook-proxy_infrastructure_plan_prod","PRNumber":333,"Program":"tfcmt","SHA1":"2fed617581d1d5b3ba0ea48f4fcfd4016240728c","Target":"fxa-webhook-proxy-cdk","Vars":{}} -->